Autodesk.Revit.DB.ElementComparerById.Compare(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Element)
Implement this method to identify the relation of the two
object for the purpose of sorting them.
Remarks:
If the comparer is for some reason unable to identify
the relations between the two object it should return value of
ElementComparisonResult.Incomparable. Such a situation is believed
to be rather rare though.
first:
One of the elements to be compared
second:
The other element to be compared
Returns:
The result of comparison. ElementComparisonResult.Incomparable if elements cannot be compared.
Since:
2015

Autodesk.Revit.DB.ElementComparerById.GetDescription
Implement this method to return a description of the comparer.
Remarks:
The purpose of this string is to describe the comparer
in more details than just a short name alone could do.
The intended use is to show the string to the end user in the UI.
Returns:
Description of the comparer.
Since:
2015

Autodesk.Revit.DB.ElementComparerById.GetName
Implement this method to return the name of the comparer.
Remarks:
Although a comparer is uniquely identified by its Id,
the Name can help to identify it to the end user in the UI.
Returns:
Name of the comparer.
Since:
2015

Autodesk.Revit.DB.ElementComparerById.GetId
Implement this method to return the id of the comparer.
Remarks:
The Id must uniquely identify the comparer.
Returns:
The id of the comparer.
Since:
2015

Autodesk.Revit.DB.ElementComparerById.GetComparerId
A static method to obtain the Id this class of a comparer.
Returns:
The Id as a GUID value
Since:
2015

Autodesk.Revit.DB.ElementComparerById.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ElementComparerById.Data
Data that controls the behavior of the comparer.
Since:
2015

Autodesk.Revit.DB.ElementComparerById.#ctor
Default constructor
Remarks:
Creates an instance of this comparer with properties set to their
default values. Use the Data property to set values differently.
Since:
2015

Autodesk.Revit.DB.ElementComparerById
The class defining the default element comparer.
Remarks:
An instance of this class is to be used if no other comparer
is explicitly set when sorting a collection of objects for the purpose
of numbering them (i.e. assigning an identifying number to them.)
Since:
2015